app/Controllers/Usuario.php

  public function index()
  {

    $usuarios = $this->UsuarioModel->findAll();
---
SELECT *
FROM `usuario`

  public function edit($id)
  {
    $usuario = $this->UsuarioModel->find($id);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '1695'

  public function perfil($id)
  {
    $usuario= $this->UsuarioModel->find($id);
---
SELECT *
FROM `usuario`
WHERE `usuario`.`id` = '1695'