app/Models/UsuarioModel.php

  public function findByMatricula($matricula)
  {

    return $this->asArray()->where(['matricula' => $matricula])->findAll();
---
SELECT *
FROM `usuario`
WHERE `matricula` = '00000229115'

  public function findUserdByRol($rol)
  {

    return $this->asArray()->where(['rol' => $rol])->findAll();
---
SELECT *
FROM `usuario`
WHERE `rol` = 'maestro'